-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2019-05-03 16:06:02
-- 伺服器版本： 10.1.38-MariaDB
-- PHP 版本： 7.3.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `qdb`
--

-- --------------------------------------------------------

--
-- 資料表結構 `employee`
--

CREATE TABLE `employee` (
  `員工編號` int(4) NOT NULL,
  `姓名` varchar(3) DEFAULT NULL,
  `現任職稱` varchar(5) DEFAULT NULL,
  `部門代號` varchar(3) DEFAULT NULL,
  `縣市` varchar(3) DEFAULT NULL,
  `地址` varchar(18) DEFAULT NULL,
  `電話` varchar(16) DEFAULT NULL,
  `郵遞區號` int(3) DEFAULT NULL,
  `目前月薪資` int(6) DEFAULT NULL,
  `年假天數` int(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `employee`
--

INSERT INTO `employee` (`員工編號`, `姓名`, `現任職稱`, `部門代號`, `縣市`, `地址`, `電話`, `郵遞區號`, `目前月薪資`, `年假天數`) VALUES
(1, '方重圍', '顧問工程師', 'A01', '新竹市', '科學工業園區工業東四路7號2樓', '035-780050', 300, 185000, 7),
(2, '何茂宗', '總經理', 'B01', '台北市', '中山區松江路301號9樓', '02-5020238', 104, 154000, 14),
(3, '黃慧萍', '特別助理', 'B01', '台北縣', '新店市寶興路45巷5號3樓', '02-9179261', 231, 82000, 14),
(4, '林建興', '研發副總', 'B01', '屏東市', '中正路688巷46弄59號', '08-7379531', 900, 138000, 14),
(5, '蔡豪鈞', '業務副總', 'B01', '桃園縣', '楊梅鎮高榮里新榮路339號', '03-4905265', 326, 36000, 7),
(6, '林森和', '助理工程師', 'C01', '台北市', '民權東路3段37號12樓', '(02)515-0000', 104, 38000, 7),
(7, '黃志文', '研發副理', 'C01', '台北市', '光復南路422號2樓之1', '02-7043828', 106, 66200, 14),
(8, '張藍方', '研發經理', 'C01', '台北市', '松德路159號-1', '02-7593733', 110, 67400, 14),
(9, '徐煥坤', '資深工程師', 'C01', '台北縣', '土城市福安街75號', '02-2685871', 236, 36000, 14),
(10, '王德惠', '研發工程師', 'C01', '台北縣', '新店市寶中路123巷1號5樓', '02-9174400', 231, 37000, 7),
(11, '莊清媚', '研發工程師', 'C02', '台中市', '北區漢口路4段367號11樓', '04-2374989', 404, 33000, 14),
(12, '張景松', '副工程師', 'C02', '台中市', '西屯區台中工業區工業五路3號', '04-3592345', 407, 31500, 14),
(13, '李垂文', '研發副理', 'C02', '台中縣', '大里市仁化路261號', '(04)491-4141#254', 412, 34500, 7),
(14, '盧大為', '研發經理', 'C02', '台北市', '大同區承德路一段40號12樓', '02-5559211', 103, 33000, 14),
(15, '江正維', '研發工程師', 'C02', '台北市', '松山區南京東路5段5號2樓', '02-7649130', 105, 61000, 14),
(16, '鍾智慧', '研發工程師', 'C03', '台北市', '八德路二段260號9樓', '02-7752450', 104, 29500, 7),
(17, '方鎮深', '副工程師', 'C03', '台北市', '士林區社中街76號', '02-8118101', 111, 32000, 14),
(18, '楊銘哲', '研發副理', 'C03', '台北市', '萬華區漢口街2段60號', '02-3111116', 108, 27200, 14),
(19, '王演銓', '研發經理', 'C03', '桃園縣', '大園鄉北港村大工路31號', '03-3868956', 337, 38200, 14),
(20, '易君揚', '助理工程師', 'C03', '桃園縣', '楊梅鎮秀才路520號', '03-4753821', 326, 75200, 14),
(21, '鄭秀家', '研發工程師', 'C03', '高雄市', '五福三路21號6樓', '07-2135522', 801, 36500, 7),
(22, '王玉治', '業務副理', 'D01', '台中縣', '潭子鄉建國路3之2號', '04-5331112', 427, 34800, 14),
(23, '林鳳春', '業務專員', 'D01', '台北市', '中正區杭洲南路1段15-1號19樓', '02-3936566', 100, 59000, 14),
(24, '葉秀珠', '業務助理', 'D01', '台北市', '南港區成功路一段65號2&3樓', '02-7832854', 115, 24800, 7),
(25, '陳曉蘭', '業務經理', 'D01', '台南縣', '歸仁鄉南興村中山路851號', '06-2306611', 711, 29500, 7),
(26, '吳美成', '資深專員', 'D01', '彰化縣', '和美鎮彰美路二段106號', '04-7352182', 508, 34800, 7),
(27, '莊國雄', '業務副理', 'D02', '台中縣', '潭子鄉中山路三段493巷35號', '04-5343566', 427, 39200, 7),
(28, '向大鵬', '業務專員', 'D02', '台北市', '建國北路2段145號3樓', '02-5031111', 104, 23400, 7),
(29, '陳詔芳', '業務助理', 'D02', '高雄市', '新興區中正二路182號8-1樓', '07-2228856', 800, 27800, 7),
(30, '陳雅賢', '業務經理', 'D02', '新竹縣', '湖口鄉光復北路92號', '035-981491', 303, 54200, 14),
(31, '吳國信', '資深專員', 'D02', '彰化縣', '福興鄉萬豐村福工路12號', '04-7695161~4', 506, 37000, 7),
(32, '張志輝', '業務副理', 'D03', '台中縣', '大肚鄉沙田路二段132巷60號', '04-6991173', 432, 31500, 7),
(33, '林玉堂', '業務專員', 'D03', '台北市', '松江路124巷21號4樓', '02-5926597', 104, 25500, 7),
(34, '張世興', '業務助理', 'D03', '台北縣', '淡水鎮下圭柔山100-2號', '02-6228750', 251, 70000, 14),
(35, '朱金倉', '業務經理', 'D03', '高雄市', '三民區通化街120號', '07-3712111', 807, 38900, 14),
(36, '謝穎青', '資深專員', 'D03', '高雄縣', '仁武鄉仁心路311號', '07-3711696', 814, 24500, 7),
(37, '毛渝南', '業務副理', 'D04', '台北市', '大安區敦化南路2段218號', '02-3779968', 106, 76000, 7),
(38, '郭曜明', '業務專員', 'D04', '台北市', '中山區八德路四段111號', '02-7532121', 105, 26000, 7),
(39, '李進祿', '業務專員', 'D04', '台北市', '松山區復興北路369號3樓', '02-7150669', 105, 25000, 7),
(40, '陳惠娟', '業務助理', 'D04', '高雄市', '三民區灣興街96之1號', '07-3853358', 807, 23000, 14),
(41, '林鵬翔', '業務經理', 'D04', '彰化縣', '和美鎮鎮平里彰草路二段697號', '04-7525121', 508, 36000, 7),
(42, '黃大倫', '採購經理', 'E01', '台中縣', '大肚鄉沙田路二段310巷2號', '04-6991191', 432, 27000, 14),
(43, '黃振清', '採購副理', 'E01', '台北市', '大同區重慶北路三段137巷25號2樓', '02-5976225', 103, 34500, 14),
(44, '林國和', '採購專員', 'E01', '台北市', '民生西路292號10樓', '02-5559676', 103, 62000, 14),
(45, '黃秋好', '採購專員', 'E01', '台北市', '新明路124號', '02-7912161', 114, 23400, 7),
(46, '陳弘昌', '採購助理', 'E01', '台南縣', '永康鄉中正北路711號', '06-2531221', 710, 22000, 7),
(47, '張琪', '採購助理', 'E01', '桃園縣', '大園鄉橫峰村1號', '03-3811811', 337, 22500, 7),
(48, '許鴻章', '維修經理', 'E01', '彰化縣', '秀水鄉埔崙村三越街82號', '04-7692511', 504, 25500, 7),
(49, '連邦俊', '維修助理', 'F01', '台北市', '大安區仁愛路三段108號7樓', '02-7042162', 106, 28900, 14),
(50, '張治', '維修工程師', 'F01', '台北市', '大安區復興南路一段390號5樓之3', '02-7081881', 106, 37800, 14),
(51, '吳寶珠', '維修工程師', 'F01', '台北市', '中山區長安東路2段173號7樓', '02-7720267', 104, 32500, 14),
(52, '洪毓祥', '維修工程師', 'F01', '台北市', '中正區忠孝東路2段123號B1', '02-3971881', 100, 40000, 14),
(53, '丁組長', '助理工程師', 'F01', '台北市', '松山區南京東路5段46號7樓', '02-7613571', 105, 28500, 7),
(54, '李秋煌', '助理工程師', 'F01', '台北市', '許昌街四二號九樓', '02-6584251', 100, 25600, 7),
(55, '何信穎', '副工程師', 'F01', '台北縣', '土城市工業區中山路59號', '02-2683366', 236, 37900, 7),
(56, '陳福金', '副工程師', 'F01', '台北縣', '樹林鎮三俊街273號', '02-6882387', 223, 28000, 7),
(57, '林靜秋', '維修副理', 'F01', '桃園縣', '龍潭鄉九龍村中興路九龍段3巷13號', '03-4792988', 325, 59500, 14),
(58, '劉柏村', '維修經理', 'F01', '高雄市', '鼓山區明倫路514巷19號', '07-5836967', 804, 31000, 7),
(59, '季正杰', '資深工程師', 'F01', '嘉義市', '中正路690號', '05-3714666', 600, 61000, 7),
(60, '顧舜生', '系統工程師', 'G01', '台中市', '台中工業區37路46號', '04-3594510', 400, 33300, 7),
(61, '祝閔豪', '系統工程師', 'G01', '台北市', '松山區民生東路4段54號9樓901室', '02-7152266', 105, 31500, 14),
(62, '鄭力中', '硬體工程師', 'G01', '台北市', '長春路328號5樓之2', '02-7198303', 104, 32500, 7),
(63, '范揚耀', '程式設計師', 'G01', '台北市', '新生南路一段121號4樓', '02-2990212', 106, 31500, 7),
(64, '高鴻烈', '程式設計師', 'G01', '台南縣', '永康市王行路68巷263號', '06-2017777', 710, 31500, 7),
(65, '林朝財', '資訊經理', 'G01', '高雄市', '三民區民族一路491號', '07-3410301', 807, 72000, 14),
(66, '陳美玉', '網路工程師', 'G01', '新竹縣', '湖口鄉新竹工業區光復南路15號', '035-983683', 303, 34500, 7),
(67, '吳淑芬', '市場分析師', 'H01', '台北市', '士林區中正路115號', '02-8822342', 111, 31500, 7),
(68, '林俊成', '企劃專員', 'H01', '台北市', '大同區貴德街36巷5號', '02-5555601', 103, 32500, 7),
(69, '簡清皛', '企劃專員', 'H01', '台北市', '中山北路六段75號', '02-8342662', 111, 31000, 7),
(70, '謝彗萍', '企劃專員', 'H01', '台北市', '中山區建國北路1段88巷12號', '02-5062442', 104, 34500, 7),
(71, '黃憲政', '企劃專員', 'H01', '台北縣', '土城市大暖路71號', '02-2683969', 236, 34500, 7),
(72, '鄭黛明', '企劃助理', 'H01', '台北縣', '淡水鎮埤島里51-11號', '02-6222131', 251, 35500, 14),
(73, '魏阿輝', '美工專員', 'H01', '台南市', '安南區安和路二段269號', '06-2552171', 709, 30000, 7),
(74, '鄭元杰', '美工專員', 'H01', '台南縣', '麻豆鎮小埤里苓子林8-12號', '06-5703271', 721, 31000, 14),
(75, '謝忠証', '美工助理', 'H01', '高雄市', '左營區新庄子路339巷3號', '07-3431236', 813, 29000, 7),
(76, '王禾', '企劃副理', 'H01', '高雄縣', '橋頭鄉芋林路299號', '07-6116622', 825, 59000, 14),
(77, '程光民', '企劃經理', 'H01', '雲林縣', '斗六市雲林路三段369號', '05-5222331', 640, 25600, 7),
(78, '楊習仁', '人事經理', 'I01', '台中縣', '烏日鄉中山路一段和平巷150弄27號', '04-3372621', 414, 28900, 7),
(79, '陳舜庭', '人事專員', 'I01', '台北市', '中山北路三段22號', '02-5925252#3408', 104, 51000, 7),
(80, '陳建岳', '人事專員', 'I01', '台南市', '中區中山路90號4樓', '06-2260191', 700, 23000, 7),
(81, '劉伯村', '人事專員', 'I01', '高雄市', '小港區長春路5號', '07-8023601', 812, 27500, 7),
(82, '張財全', '人事助理', 'I01', '高雄市', '前鎮區高雄加工出口區南一路10號', '07-8111171', 806, 31000, 7),
(83, '陳淑慧', '行政助理', 'J01', '台北市', '大安區仁愛路四段109號15樓', '02-7110990', 106, 23000, 7),
(84, '許進發', '行政經理', 'J01', '台北市', '敦化北路201-24號8樓', '02-7177888', 105, 21000, 14),
(85, '王芳香', '行政專員', 'J01', '新竹市', '科學工業園區工業東二路6號', '035-773121', 300, 28000, 7),
(86, '施美芳', '行政專員', 'J01', '嘉義縣', '水上鄉回歸村北回60號', '05-2357861', 608, 69900, 7),
(87, '劉大慶', '總機', 'J01', '彰化縣', '和美鎮彰新路二段290號', '04-7351127', 508, 30000, 14),
(88, '沈榮治', '會計助理', 'K01', '台北市', '莒光路310號5樓', '02-3062131', 108, 41200, 14),
(89, '王繡瑩', '會計助理', 'K01', '台北市', '復興北路181號6樓', '02-7129111', 105, 40000, 7),
(90, '林俐君', '會計師', 'K01', '台北市', '敦化北路201-24號後棟6樓', '02-7174500', 105, 27200, 7),
(91, '李德竹', '會計師', 'K01', '台南縣', '歸仁鄉南保村中山路734號', '06-2301171', 711, 65000, 7),
(92, '胡富傑', '會計經理', 'K01', '桃園縣', '觀音鄉富源村35-2號', '03-4901511', 328, 34500, 7),
(93, '唐德義', '資深會計師', 'K01', '高雄市', '林森三路193巷34號', '07-3336571', 806, 31500, 14),
(94, '鍾海萍', '資深會計師', 'K01', '新竹市', '科學工業園區展業一路20號2樓', '035-770255', 300, 25000, 7),
(95, '溫智傑', '圖書助理', 'L01', '台北市', '中山區南京東路一段92號8樓', '02-5316125', 104, 21000, 7),
(96, '邱資堡', '圖書助理', 'L01', '台北市', '塔城街66號3樓', '02-5523075', 103, 28100, 7),
(97, '洪惠芬', '圖書館專員', 'L01', '高雄縣', '大社工業區興工路1-3號', '07-3514151', 815, 11000, 14);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `employee`
--
ALTER TABLE `employee`
  ADD PRIMARY KEY (`員工編號`);

--
-- 在傾印的資料表使用自動增長(AUTO_INCREMENT)
--

--
-- 使用資料表自動增長(AUTO_INCREMENT) `employee`
--
ALTER TABLE `employee`
  MODIFY `員工編號` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=98;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
